using System;
using System.Collections.Generic;
using System.Text;
using Rogue.Drawing.Impl;
using Rogue.Map;
using Rogue.Settings;
using Rogue.View.Interfaces;

namespace Rogue.Drawing.WorldMap
{
    public class WorldMapDrawSession : DrawSession
    {
        public Biom Biom { get; set; }

        public DrawingSize DrawingSize { get; set; }

        public WorldMapDrawSession()
        {
            this.DrawRegion = new Types.Rectangle
            {
                X = 2,
                Y = 2,
                Width = DrawingSize.MapChars-2,
                Height = DrawingSize.MapLines-2
            };
        }

        public override IDrawSession Run()
        {
            string template = string.Empty;

            Console.SetCursorPosition(0, 3);
            switch (Biom.Color)
            {
                case ConsoleColor.DarkCyan: { template = WorldTemplates.Mount; break; }
                case ConsoleColor.DarkGreen: { template = WorldTemplates.Three; break; }
                case ConsoleColor.DarkYellow: { template = WorldTemplates.Demon; break; }
                case ConsoleColor.Gray: { template = WorldTemplates.Dwarf; break; }
                case ConsoleColor.DarkMagenta: { template = WorldTemplates.Drow; break; }
                case ConsoleColor.DarkGray: { template = WorldTemplates.Dead; break; }
            }

            var lines = new List<IDrawText>();
            foreach (var line in template.Split('\r'))
            {
                lines.Add(new DrawText(line, Biom.Color));
            }

            this.Batch(0, 0, lines);

            return this;
        }
        
        private static class WorldTemplates
        {
            public static string Mount
            {
                get
                {
                    string s =

@"
                +*  *#######@#= ##:                              %##* 
               @#####: *#=   +#= #@                              ##   
     2       #@:#= %#:   * ###:@# +#*                           +#@   
           ##:##   ##  ####:*:%#  #=                      :=###@:     
          +#*  %#: :####  *##* ##:##       3          =###@*         %
          ##     :###+ @#*      #@*#%               =#@  *+:       =##
        +#%    +##: ##*         :#@ %##%####+      +#* %#%:    +%%##  
      :##:##: @#:    :###:        ##   *:   %#%    =#::#*   :##=      
  +#####   *%*+       #%%#*       *#% ####@   ##   @#   *####*        
 ##  *+                            +#:@#  %##= =####=   @#          :=
                                   :#= ##@@@%#=   ::  *=#%         ##*
                              :%    =#*     :  +#####@+*          #@  
                    4        =#@#+   =#%  =###%+                 :=   
                   %###      #% =#*    +%%+    %+  %%:       %###:    
                            *#=  %#+###%: =##@####@+%#*      #@ =#+###
    =##:       5            @#   :#@:  +@#@  %#*   * :@%###@#@*####@::
     6        ::            *: :####   %#%  =%:  :####*@*    +#= =###@
                               *#* @###+ @##++#%##*  +########@*#%:  @
   *=###        =#     @####@@###  +#:    +#%  *+=*  =:  =#+  *##%  +%
 %@=** =##%  *##@##:  +#+ *%@#%*#% :%###:    *#%:*###@###%       ###%@
".Replace('@', '&');
                    //if (Rogue.RAM.Map.Name.IndexOf("Руины") > -1) { s = s.Replace('6', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поселение") > -1) { s = s.Replace('5', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Катакомбы") > -1) { s = s.Replace('4', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поле боя") > -1) { s = s.Replace('3', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Храм") > -1) { s = s.Replace('2', '@'); }
                    return s;
                }
            }

            public static string Three
            {
                get
                {
                    string s =
@"
   -##:               -%#####+:*- :######=-          +##:            
   =#=             -%##=- :#@      +#=  -@##%-        -##-           
  %#+     6      +#########%-      +######*-@#%        :##-          
 +#%           :##:     -*=%@#######%*-      *##:       -##:         
 ##-          +##-    :##%*:--  5  -*@##%      %#=       +#=         
 ##          =#=     -##               +#%      %#*      +#+         
 ##         %#=     +@*##@:-+#####@::###*+##    -##-     :#%         
-##        +#+     %#%##@%###-   -*@@*=##@+#@    @#-      %#+        
-#@        +#+     ##- -*##-        =#%-   #@ *####:      -#@        
-#@        =#:     ##    ##-   4    +#+    #@+#= @#-      -#@        
-#@        =#####* ##    -##-      -##-   -##@#--##       -##-       
-##        +#%- *#%@#*    -##@-  -@#@-   -##-+####:        *#=       
 =#%        %#+-=#%-@#=     -##- %#*    -@#*  -*##         :#%       
  :##-      -###@-   *##:*++=#@  %#@@%-@#@-    =#=     3   @#:       
   -##-     -##%       +##****-   ---*##+    -@#+         +#%        
    :##- -=##@-:###-    ##      2    -##     @##-       *##*         
     -####%:%###*-@##:  ##            ##   *@:-%#@-   =##*           
   -###*-%##=-      +#####@@@@@@@@@@%%##%##@@##+-@#####*             
 :##%-:##%@#+          -+###+     -::###%-    :##=:##%-              
".Replace('@', '&');
                    //if (Rogue.RAM.Map.Name.IndexOf("Руины") > -1) { s = s.Replace('6', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поселение") > -1) { s = s.Replace('5', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Катакомбы") > -1) { s = s.Replace('4', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поле боя") > -1) { s = s.Replace('3', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Храм") > -1) { s = s.Replace('2', '@'); }
                    return s;
                }
            }

            public static string Demon
            {
                get
                {
                    string s =
@"
                                  ##################@                
           ###                  ###########*     %####@              
     +##########        ###########-               %#######-         
    #######: ###     :##########-                    :#######-       
   +###    -####     ####-                                ####       
   ####  6 ####     #####               4                  ###       
    ####+  ####    ####-                                 *####       
     :####  ###@   +####                               ######        
      #########     ####                              ####*          
       ######       -###%                            ####            
                    ####          3                  ####            
        +#####      ###                              ####            
     -##########:   ####                              ####           
    #####    ####    ####**                         2  ####          
   ####      -####*  :######%                     *+++* ####         
   ####        %#####    #######                ############         
   ####    5    @####    #######               ####  #####-         
   ####           ####        ####               ###*                
  -####       #######:        *###             #####*                
 -####      ######            ####           ######:                 
   #############               +##################                    
".Replace('@', '&');
                    //if (Rogue.RAM.Map.Name.IndexOf("Руины") > -1) { s = s.Replace('6', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поселение") > -1) { s = s.Replace('5', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Катакомбы") > -1) { s = s.Replace('4', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поле боя") > -1) { s = s.Replace('3', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Храм") > -1) { s = s.Replace('2', '@'); }
                    return s;
                }
            }

            public static string Dead
            {
                get
                {
                    string s =
@"
        #                               ##                           
         ####                       #### ##       #####              
             ##           #####  ########  #####  #    ###           
           ###       #####   ##          ##    #  ##    ##           
         ##         ##  ######     #####  #   ##  ##   ##            
       ##   #####   ##  ####     ##  ####  ###  ##     #####         
       #####     #   ### ##     ## ##  #####    #####     ##         
       ##   ##### ##########   ##  ##  ####         ##     ##        
        #####    ## ###        ## 4##  ## #   #  ### ##    ##        
       ####  ####  ###          ####  ##   #####  ##  ##   ##        
                  ##         ###  #  ## 2  ##  ####  ## ## #         
                  ####  ###### ##  ###   ##     ####  #### ####      
                   ##  ##    ##    #    ##  ####    ##   ##   ##     
                    ##  ##    #### ##### ## ######  ##     ###       
            5       ##  ##       ##     ##     ##   ### ## ###       
                    ##   #########  ###  ###   ##      # ##          
                     ##     6      ###      ########     ####        
          3      #####        ####     ########   ##        ##       
                ##     #### ##   #####  ##   #    #     ######       
                ##    ## ## #         ##  ## #   ##    ## ##         
".Replace('@', '&');
                    //if (Rogue.RAM.Map.Name.IndexOf("Руины") > -1) { s = s.Replace('6', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поселение") > -1) { s = s.Replace('5', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Катакомбы") > -1) { s = s.Replace('4', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поле боя") > -1) { s = s.Replace('3', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Храм") > -1) { s = s.Replace('2', '@'); }
                    return s;
                }
            }

            public static string Dwarf
            {
                get
                {
                    string s =
@"
 +#####%%###            =@#########=======@##%%===@####@@@%====##+   
    *=%##=##+                    @#@==%#########%=#######@#######*   
     %###2##=                     @#####*      ##%###@%+             
    @##%####*                                 *##==%%@######=        
     +@#@+                         @###@      +##=######===@##%      
                                  ##@=%##+    ##%##%  ##%=6=@#@      
                                 *##%==##=   %##=##+  @#######=      
                              =####@==##@   %#####*     *+++         
                             +##%===%##*   ###@#@      +=%=*         
             *@###*  *#########%@%==##+   =##=##*   #####@##%        
      *########%%##* ##%=@#########%###*  +##=##++=##@====@#%        
      ##%==%#####%##+##=###++*    %##@##% *########@=@@@@@##+        
      %######*=##=@####@=@#####     %####    *%#######@@@@=          
            *###===5######@%%##*     ##@##########3###########@*     
           %##%=====@#@  +@###*     *##=%@############%==%%%%%##@    
            ########@####%           @####=%###@+    %###=====##@    
              *====%###%##                ##@%%###+    *#######=     
                   +##%##@=%########%####+=###%==###                 
          +%@@@@+ @##==####@%@####%@@@=@####%4###=##                 
       %####@@@@###@###%==#%%##%+#############=##%##                 
     @##%@###################=##+       ######@#@##@                 
".Replace('@', '&');
                    //if (Rogue.RAM.Map.Name.IndexOf("Руины") > -1) { s = s.Replace('6', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поселение") > -1) { s = s.Replace('5', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Катакомбы") > -1) { s = s.Replace('4', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поле боя") > -1) { s = s.Replace('3', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Храм") > -1) { s = s.Replace('2', '@'); }
                    return s;
                }
            }

            public static string Drow
            {
                get
                {
                    string s =
@"
#####################################################################
#####################################################################
#####################################################################
#################### 6**+@###########################################
#########################*###########################################
#########################:########-      -###########################
########################=:#######=        :#####%    %###############
########################@    =###=    3    -+=+:  4  *###############
########################-    -###@        @#####@    *###############
########################*     #####=-    :###########################
########################=     #######-%##############################
###########################%*=#######################################
############################@%#######=###############################
#######################--=@#########--@##############################
#######################:##########*     -+++#########################
#######################*##########:  5  %####=#######################
#####################=  -#########      =###=@#######################
#####################= 2 +#########%===#####=@#######################
############################################@+#######################
#####################################################################
#####################################################################
#####################################################################
#####################################################################

".Replace('@', '&');
                    //if (Rogue.RAM.Map.Name.IndexOf("Руины") > -1) { s = s.Replace('6', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поселение") > -1) { s = s.Replace('5', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Катакомбы") > -1) { s = s.Replace('4', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Поле боя") > -1) { s = s.Replace('3', '@'); }
                    //if (Rogue.RAM.Map.Name.IndexOf("Храм") > -1) { s = s.Replace('2', '@'); }
                    return s;
                }
            }
        }
    }
}
