{
  "WarriorAttack": "Сильный удар",
  "WarriorAttack.Desc": "Наносит удар тупой стороной оружия по одной цели игнорируя физическую броню.",
  "WarriorThrow": "Бросок оружия",
  "WarriorThrow.Desc": "Бросает оружие в цель во втором ряду. В следующий ход враг будет атаковать война.",
  "WarriorStand": "Защитная стойка",
  "WarriorStand.Desc": "Увеличивает физическую защиту уменьшая урон от способностей.",
  "WarriorWarcry": "Боевой клич",
  "WarriorWarcry.Desc": "Заставляет всех врагов атаковать война в следующий ход.",
  "MageArrowAttack": "Магическая стрела",
  "MageArrowAttack.Desc": "Выпускает магическую стрелу способную нанести урон в любом радиусе.",
  "MageAoe": "Сфера огня",
  "MageAoe.Desc": "Выпускают сферу огня наносящую урон в небольшом радиусе.",
  "MageShield": "Каменная кожа",
  "MageShield.Desc": "Увеличивает физическую и магическую защиту дружественной цели.",
  "MageSummon": "Призыв элементаля",
  "MageSummon.Desc": "Призывает элементаля сражающегося на вашей стороне со случайной целью.",
  "ThiefAttack": "Скрытая атака",
  "ThiefAttack.Desc": "Скрытая атака выполняется после любой следующей атаки дружественного существа.",
  "ThiefShadow": "Удар тьмы",
  "ThiefShadow.Desc": "Атака наносящая урон от магии тьмы двум рядом стоящим целям.",
  "ThiefMark": "Метка смерти",
  "ThiefMark.Desc": "Удар наносящий небольшой урон но оставляющий метку на цели увеличивающую повреждения.",
  "ThiefStep": "Быстрый шаг",
  "ThiefStep.Desc": "После активации позволяет совершить два действия подряд в этом ходу.",
  "PriestAttack": "Ошеломляющий удар",
  "PriestAttack.Desc": "Атака ближнего боя с шансом оглушить врага на один ход.",
  "PriestHeal": "Исцеление",
  "PriestHeal.Desc": "Исцеляет выбранного члена отряда. Не работает на призванных существ.",
  "PriestHolyNova": "Волна света",
  "PriestHolyNova.Desc": "Волна света исцеляющая всех членов отряда.",
  "PriestAngel": "Помощь ангела",
  "PriestAngel.Desc": "Призывает ангела который увеличивает исходящее исцеление и может пожертвовать собой ради жреца.",
  "Muitu": "Водяной поток",
  "Muitu.Desc": "Выпускает поток воды наносящий урон на любой дальности.",
  "Shamshu": "Божественное свечение",
  "Shamshu.Desc": "Наносит атакующему урон от светлой магии",
  "Balatu": "Помощь стихий",
  "Balatu.Desc": "Шанс призвать духа случайной стихии при атаке",
  "Galla": "Благословение Ллотх",
  "Galla.Desc": "Шанс при атаке привязать цель к месту ",
  "Adamatu": "Суть крови",
  "Adamatu.Desc": "Исцеляет d4 от нанесённого урона врагу",
  "Sinisat": "Страсть богини",
  "Sinisat.Desc": "Позволяет передать часть своего здоровья союзнику",
  "Ketsoal": "Кровавое безумие",
  "Ketsoal.Desc": "При использовании накладывает на цель особое кровотечение, увеличивающее максимальное здоровье на количество потерянного от кровотечения",
  "Kararu": "Великие кузнецы",
  "Kararu.Desc": "Персонаж получает +1 к рангу навыка Ремонт и +1 ранг ко всем навыкам создания физических предметов.",
  "Esmaru": "Крылья богов",
  "Esmaru.Desc": "В два раза увеличивает значение Скорости",
  "Buru": "Глиняные дети",
  "Buru.Desc": "Урон от божественной магии исцеляет на количество нанесённых повреждений",
  "Habash": "Защитники луны",
  "Habash.Desc": "Возможность принять облик медведя.",
  "Isshar": "Мудрецы луны",
  "Isshar.Desc": "Возможность принять облик ворона.",
  "Shelib": "Воины луны",
  "Shelib.Desc": "Возможность принять облик лисы или волка.",
  "Nahazu": "Дикая магия",
  "Nahazu.Desc": "Один раз за бой увеличивает Ловкость и Конституцию на d4* и даёт иммунитет к урноу от огня в течении d4* ходов.",
  "Usapu": "Талант к магии",
  "Usapu.Desc": "Первая использованная в бою *магическая* способность может быть повышена на один ранг с помощью Воли",
  "Shalmu": "Кража духа",
  "Shalmu.Desc": "Наносит d4 чистого урона магией духа",
  "Gray": "Дитя страха",
  "Gray.Desc": "Шанс 1/d12 при контакте с врагами повергнуть их в состояние Страха: в нём цель не может ничего делать и получает уязвимость к физическому урону на d4 ходов",
  "Vanguard": "Строй Авангарда",
  "Vanguard.Desc": "Если слева и справа от персонажа стоят представители Авангарда, полученный урон равномерно распределяется по всем троим",
  "Vanguard.Globally": "Знания об опасностях",
  "Vanguard.Globally.Desc": "Позволяет определять уровень опасности столкновений во время путешествия. Персонажа больше не могут застать в расплох.",
  "MageCircle": "Орден Магии",
  "MageCircle.Desc": "Позволяет выбрать орден Круга Магов, способности которого по умолчанию повышают ранг и их можно будет изучать без условий",
  "MageCircle.Globally": "Знание свитков",
  "MageCircle.Globally.Desc": "Позволяет изготавливать и читать свитки с боевыми заклиняниями. Свитки доступны только представителям Круга Магов.",
  "ShadowGuild": "Яды",
  "ShadowGuild.Desc": "Возможность создавать яды и автоматически использовать их при атаке",
  "ShadowGuild.Globally": "Теневая торговля",
  "ShadowGuild.Globally.Desc": "Позволяет торговать с представителями теневой гильдии и получать теневые монеты",
  "Exarchate": "Целительство",
  "Exarchate.Desc": "Позволяет создавать и использовать исцеляющие предметы",
  "Exarchate.Globally": "Апкаллу",
  "Exarchate.Globally.Desc": "Увеличивает Диалектику на один ранг. Будучи одним из верховных ангелов вы можете использовать свой статус для получения преимуществ",
  "DeathCult": "Тайные знания",
  "DeathCult.Desc": "Позволяет персонажу изучать навыки из книг",
  "DeathCult.Globally": "Обереги",
  "DeathCult.Globally.Desc": "Позволяет создавать и носить комбинированные (до пяти в одном) обереги",
  "Attension": "Изучение",
  "Attension.Desc": "Позволяет изучать окружение и замечать скрытые детали: сундуки, двери, тайные ходы.",
  "Landscape": "Изменение ландшафта",
  "Landscape.Desc": "Позволяет изменять ландшафт: копать траншеи, тоннели, вырубать деревья, убирать огромные камни, строить естественные плотины.",
  "Prayers": "Молитвы",
  "Prayers.Desc": "Позволяет превозносить молитвы богам и получать за это награды. Несколько молящихся жрецов в группе позволяют увеличить значение молитвы",
  "Portals": "Порталы",
  "Portals.Desc": "Позволяет телепортировать группу персонажей на расстояние зависящее от ранга умения. Несколько магов могут увеличивать расстояние телепортации на расстояние равное рангу умения других магов"
}