{
  "Muitu": "Серые, изначально поселившиеся на острове. Из особенностей народа можно выделить их большую связь с водой – они прекрасно её переносят, могут пить солёную воду, и являются самыми лучшими моряками во всём мире. Кроме морского ремесла, они отлично справляются с особыми травами, произрастающими на острове, из этих трав они варят целебное мыло, а отдельные, редкие виды трав могут исцелить даже болезни, насланные божествами. Муиту очень дружелюбный и трудолюбивый народ, они всегда рады любым путешественникам, и гостеприимны как никто другой. Из особенностей народа выделяются зрачки цвета неба, и немного голубоватый тон кожи.",
  "Shamshu": "Живые, проживающие на территории экзархата - благодаря благодати, их кожа стала золотистого цвета, некоторые посвященные обрели возможность управлять светлой магией. Как правило, Шамшу очень религиозны, т.к. их вера в экзарха подпитывается каждый цикл мерцания.",
  "Balatu": "Живые, созданные Сабу. Их загрубевшая кожа больше похожа на кору деревьев. Балату пропитаны силой хаоса – сопряжением всех стихиями, из-за этого они сильно привязаны к природе. Основное занятие Балату – создание и начертание рун на оружии и доспехах. Их кровь обладает дополнительными свойствами, а загрубевшая кожа является дополнительным слоем защиты. Так же выделяется отдельный вид Галла: Воздвигшие курган Балату, получившие дар духов стихии земли. Кроме кожи и крови своих сородичей имеют нижнюю часть от паука, их восемь лап позволяют им быстро рыть тоннели и плести исключительные полотна из паутины и веток.",
  "Matu": "Живые, которые пришли в земли Нисан. Она напоила их кровью, и они смогли выживать и построить своё небольшое государство. Они назвали себя Мату – кровь. После Макалумату все Мату были разделены на три разных народа:\\r\\nАдамату\\r\\nМату, которые во время Макалумату пили кровь из её сердца. Адамату значит «тёмная, венозная кровь», к сердцу Нисан подпускались только высшие чины и великие войны, поэтому Адамату — это только мужчины.\\r\\Синисат\\r\\nМату, которые во время Макалумату пили кровь из её груди. Синисат значит «женщина». Кровь из груди Нисан позволялось пить только женщинам, из-за чего они получили возможность зачатия без участия мужчин, а только обменом своей крови.\r\nКецоаль\r\nМату, которые пили кровь из ступней Нисан. Кецоаль означает «земля» - все, кто не относился к касте войнов или правителей и ещё не могли рожать – пили кровь из её ступней. Отчего подверглись изменениям меньше всего.",
  "Kararu": "Народ, проживающий в горных лугах и отстраивающий первые цеха древних. Их наименование с языка древних переводится как «огненные | знойные», такое имя дал им божественный кузнец и владыка этих территорий – Тамус. Изначально прибывающие сюда живые, как и все остальные, были серыми. Лишь с течением времени они изменили цвет своей кожи на светло-коричневую, подвергаясь каждый день жару божественной горы-кузни. Карару отличались развитой культурой и технологиями, об их монументальных городах-крепостях до сих пор слагают легенды. Они не были вынуждены ни с кем воевать, страдать от холода или голода, а правление их царя Фраваша было справедливым и милосердным. Гибель народа пришла вместе с катаклизмом, вызванным смертью бога, все его представители в горных лугах превратились в пепел, и лишь небольшая коммуна паломников, отдалившаяся от горы-кузни, смогла выжить.",
  "Esmaru": "Когда богиня Нашо обнаружила кости Великого Отца – она побоялась что кто-то причинит им вред. Для того что бы сохранить его тело в целости, она, используя свои силы проводила мысли отца через себя и изменила часть великанов, которые уже подверглись влиянию мыслей отца. Они уменьшились в размерах почти до привычного для остальных живых, однако их сила и связь с магией остались прежней. Их кожа стала практически белой и источала небольшой свет. Нашо назвала Эсмару – «блестящий, белый». В период развития конгрегации Нашо нарекла Эсмару живыми ангелами, а Белый замок – священным местом.",
  "Buru": "Самоназвание - «глинянный сосуд». Когда Нашо обрела большое количество последователей, она стала «освещать их» - превращать в таких же ангелов, как и Эсмару. Но по каким-то причинам ритуалы посвящения проходили не так как паломники ожидали. Большая часть взрослых живых стала умирать, а их дети переставали расти. Несмотря на то, что дети не росли, они всё ещё взрослели, а некоторые делали это слишком быстро. До последнего момента Нашо уверяла их что Буру станут ангелами, а число смертей всё росло. После того как гора взорвалась и мысли отца стали невыносимыми, Нашо и вовсе отвернулась от Буру, и они вынуждены были уйти под землю и основать там своё новое царство - Сапларал. Большинство Буру отвернулись от магии и стали инженерами, кузнецами, и шахтёрами. А оставшиеся жрецы и маги Буру пытаются создать нового бога – такого, который поможет им отомстить Нашо. От ангелов им достались белые, сияющие глаза. А кожа стала тёмно-серой, немного обугленной.",
  "Habash": "Самые большие и крепкие живые из тех, что обучались у Тешрина смене формы. Тешрин научил их принимать облик медведей, а их название переводится как «дикие животные». Хабаш – одни из самых крупных представителей живых, а в форме медведя самые сильные из животных. Тешрин попросил их охранять мировое дерево – и за множество циклов мерцания они смогли познать всю его магию. Хабаш назвали своё учение магии друидизм – и даже научились преподавать его. Из ремёсел они занимаются кузнечным делом, перерабатывая руду которую вымывают из земли обогащённой корнями древа мира.",
  "Nahazu": "После того как Айлул передала живым искру божественного огня, они получили «дар дикой магии», а вместе с этим и особую внешность – больших, красных и рогатых существ. Айлул назвала их Нахазу, что на языке богов значит «демоны» - она нашла подходящих под описание существ с таким же названием в пророчествах Хэзар-Афсэнэ – красных, с ногами-копытами, рогами, и крыльями. Остальные живые не доверяют и даже боятся Нахазу из-за их внешнего вида.",
  "Usapu": "Живые, изначально пребывающие на территории империи ушал. Изначально серые, как и все остальные, они начали меняться из-за нефритового столпа, который появился в этих землях – их кожа вначале приобрела зеленоватый, а затем светло-жёлтый оттенок. Благодаря тому, что они поколениями жили на земле питающейся магией от нефрита – они самые приспособленные из живых к магии. Однако магия никак не повлияла на их тела, и Усапу остались такими же хилыми и слабыми существами как изначальные живые.",
  "Shalmu": "Живые, изначально обитавшие на самом юге континента. В отличие от остальных мест на материке, они не получали: ни пагубного влияния стихий, ни бесконечной засухи или влаги, ни недостатка свет, ни любых других прямых или косвенных изменений их плоти от детей Лилит. Вместо этого Шалму подверглись «пульсу мира». Из-за него из живых стал постепенно отделяться дух – это привело к тому, что их тела чернели, и начинали умирать, но душа оставалась здоровой. Их название «шалму» - означает чёрная плоть. Преодолеть проклятие пульса мира им помог «древний мудрец», принеся особые, охранные амулеты, Шалму перестали умирать, но их кожа всё равно осталась чёрной.",
  "Gray": "Заготовка живых существ от Лилит – гуманоиды среднего размера, серые, без каких-либо выдающихся черт. Очень податливые к изменению и невероятно приспосабливаемые."
}