{
  "StrengthDescription": "Отражает физическую силу персонажа. Увеличивает силу атаки, множитель урона скользящих ударов, шанс сокрушительных ударов, позволяет носить более тяжёлую броню.",
  "AgilityDescription": "Ловкость показывает на сколько персонаж ловок и подвижен. Увеличивает физический урон оружием, шанс критического урона, уклонения и парирования. Уменьшает шанс промаха и повышает скорость.",
  "IntellegenceDescription": "Интеллект показывает на сколько персонаж умён и сродён с магией. Увеличивает силу магии, пробивание, шанс отражения магии и магическую защиту.",
  "StaminaDescription": "Выносливость отражает физическую стойкость персонажа. Увеличивает здоровье, уменьшает шанс наложения эффектов и их наносимый урон.",
  "Проницание магииDescription": "Определяет урон который наносится не смотря на магическую защиту. Проницание не работает на заклинания по площади.",
  "Сокрушительный ударDescription": "Шанс нанести сокрушающий удар работает только для направленных атак и заклинаний по целям с 30% здоровья и ниже. Сокрушающие удары наносят x3 урон.",
  "Скользящий ударDescription": "Скользящие удары работают на цели с классом брони 1+ и только для физических атак. Скользящий удар наносит урон согласно параметру 'урон скользящих ударов', но не меньше половины урона.",
  "Урон скольз. ударовDescription": "Определяет множитель нанесения урона для скользящих ударов",
  "ПарированиеDescription": "Шанс паррировать атаку. Войны и воры могут паррировать физические атаки. Маги и жрецы - магические атаки. При успешном паррировании урон отражается в противника, добавляя модификаторы физической или магической атаки.",
  "Шанс физ. эффектовDescription": "Шанс применения физических эффектов к персонажу.",
  "Урон физ. эффектовDescription": "Урон от применённых к персонажу физических эффектов",
  "Шанс маг. эффектовDescription": "Шанс применения магических эффектов к персонажу.",
  "Урон маг. эффектовDescription": "Урон от применённых к персонажу магических эффектов",
  "Шанс физ. блокаDescription": "Шанс блокировать физическую атаку. При блокировании атаки наносится только половина урона, а физические эффекты не накладываются. Работает только со щитами.",
  "УклонениеDescription": "Уклонение доступно только при классе брони не выше 1. Шанс уклониться от атаки и полностью избежать урона. Работает для физических атак и заклинаний.",
  "Защита от огняDescription": "Уменьшает урон от огня и горения на значение защиты.",
  "Защита от холодаDescription": "Уменьшает урон от холода, льда и окоченения на значение защиты.",
  "Защита от магииDescription": "Уменьшает весь магический урон не относящийся к стихиям на значение защиты.",
  "Защита от светаDescription": "Уменьшает весь урон от магии света на значение защиты.",
  "Защита от тьмыDescription": "Уменьшает весь урон от магии тьмы на значение защиты.",
  "Отражение магииDescription": "Шанс отразить заклинание обратно в противника. Для заклинаний по площади увеличен в два раза и рассчитывается для каждого нанесения урона.",
  "Класс брониDescription": "Класс брони указывает на сколько защищен персонаж. Отсутствие брони означает 0 класс.\r\n1 класс брони - у врага повляется шанс скользящего удара по персонажу\r\n2 класс брони - у персонажа иммунитет к режущим атакам\r\n3 класс борни - у персонажа иммунитет к колющим атакам",
  "БроняDescription": "Уменьшает входящи физический урон. Каждая единица брони уменьшает получаемый физический урон на 0.25",
  "Шанс крит.Description": "Шанс нанести двойной урон физической или магической атакой. Для навыков нааносящих урон по нескольким целям, рассчитывается отдельно для каждой цели. Не работает на дружественные цели.",
  "МеткостьDescription": "Определяет шанс попадания по цели. Для навыков наносящих урон по нескольким целям, рассчитывается отдельно для каждой цели. Работает на дружественные цели.",
  "ИнициативаDescription": "Определяет очередность хода в раунде.",
  "СкоростьDescription": "Скорость отражает кол-во атак которое персонаж может совершить в один раунд. Считается только кратное единицы количество",
  "Сила магииDescription": "Сила магии увеличивает наносимый магический, элементальный, светлый и тёмный урон на 0.5 за каждую еденицу.",
  "Сила атакиDescription": "Сила атаки увеличивает наносимый физический урон на 0.5 за каждую единицу.",
  "УронDescription": "Наносимый урон физическими атаками. Урон увеличивается от использования оружия. Сокрушительные, скользящие и критические удары влияют именно на физический урон.",
  "ЗдоровьеDescription": "Здоровье персонажа позволяет ему участвовать в бою. Персонажи с нулевым здоровьем могут быть воскрешены в церквях или жрецами.",
  "ОпытDescription": "Опыт накапливается в бою и при выполнении заданий. Кол-во опыта до следующего уровня растёт с каждым следующим уровнем.",
  "УровеньDescription": "Уровень персонажа, отражает общую силу персонажа. Каждый уровень персонаж получает дополнительное здоровье в зависимости от класса и свободные очки навыков или характеристик.",
  "Опыт": "Опыт",
  "Инициатива": "Инициатива",
  "Уровень": "Уровень",
  "Здоровье": "Здоровье",
  "Урон": "Урон",
  "Сила атаки": "Сила атаки",
  "Сила магии": "Сила магии",
  "Скорость": "Скорость",
  "Меткость": "Меткость",
  "Шанс крит.": "Шанс крит.",
  "Броня": "Броня",
  "Класс брони": "Класс брони",
  "Отражение магии": "Отражение магии",
  "Защита от огня": "Защита от огня",
  "Защита от холода": "Защита от холода",
  "Защита от магии": "Защита от магии",
  "Защита от света": "Защита от света",
  "Защита от тьмы": "Защита от тьмы",
  "Уклонение": "Уклонение",
  "Шанс физ. блока": "Шанс физ. блока",
  "Проницание магии": "Проницание магии",
  "Сокрушительный удар": "Сокрушительный удар",
  "Скользящий удар": "Скользящий удар",
  "Урон скольз. ударов": "Урон скольз. ударов",
  "Парирование": "Парирование",
  "Шанс физ. эффектов": "Шанс физ. эффектов",
  "Урон физ. эффектов": "Урон физ. эффектов",
  "Шанс маг. эффектов": "Шанс маг. эффектов",
  "Урон маг. эффектов": "Урон маг. эффектов",
  "Strength": "Сила",
  "Agility": "Ловкость",
  "Intellegence": "Интеллект",
  "Stamina": "Выносливость",
  "Назад": "Назад",
  "Далее": "Далее",
  "Инвентарь отряда": "Инвентарь отряда",
  "Основное": "Основное",
  "Защита": "Защита",
  "Дополнительно": "Дополнительно",
  "Свободные очки": "Свободные очки",
  "навыков и характеристик": "навыков и характеристик",
  "Навыки": "Навыки",
  "Характеристики": "Характеристики",
  "IgnoreTargetPhysicalDefence": "Игнорирует физическую защиту цели",
  "Damage": "Урон",
  "Heal": "Исцеление",
  "Incoming": "Входящий",
  "Active": "Действует",
  "Turn": "Ход",
  "Turns": "Ходов",
  "Attack": "Атака",
  "Defence": "Защита",
  "Barrier": "Барьер",
  "Type": "Тип",
  "Range": "Дальность",
  "StunChanse": "Шанс оглушить",
  "Health": "Здоровье",
  "HealEffective": "Эффективность исцеления",
  "Sacrifice": "Умирает вместо призвавшего",
  "Taunt": "Провоцирует",
  "NotAffectSummoned": "Не действует на призванных существ",
  "HideAttack": "Скрытая",
  "EachHandAttack": "Атака оружием в каждой руке",
  "RightHandAttack": "Атака оружием в правой руке",
  "LeftHandAttack": "Атака оружием в левой руке",
  "RangeClose": "Ближний бой",
  "RangeFar": "Дальний бой",
  "RangeAny": "Любой",
  "RangeFriendly": "Дружественная цель",
  "Summon": "Призыв",
  "RangeWeaponDepends": "Зависит от оружия",
  "Healing": "Исцеление",
  "ElemenentalUnitHis": "Элементаля",
  "Area": "Область",
  "Cooldown": "Восстановление",
  "EnterCharacterName": "Введите имя персонажа",
  "Abilities": "Способности",
  "Apples": "Яблоки",
  "Skills": "Навыки",
  "LeftMouseButton": "ЛКМ",
  "Info": "Информация",
  "Warrior": "Воин",
  "Mage": "Маг",
  "Thief": "Вор",
  "Priest": "Священник",
  "Next": "Далее",
  "Prev": "Назад",
  "Cancel": "Отмена",
  "CreateParty": "Создание отряда",
  "NewGame": "Новая игра",
  "Save": "Сохранить",
  "Load": "Загрузить",
  "Settings": "Настройки",
  "Credits": "Авторы",
  "FastGame": "ККИ",
  "ExitGame": "Выйти",
  "Friendly": "Арбитры",
  "Neutral": "Нейтралитет",
  "Vanguard": "Авангард",
  "MageGuild": "Гильдия магов",
  "Mercenary": "Наёмники",
  "Exarch": "Экзархат",
  "Cult": "Культ проклятых",
  "Landscape": "Ландшафт",
  "Eating": "Расход еды",
  "Repair": "Ремонт",
  "Weaponcraft": "Оружейничество",
  "Portals": "Порталы",
  "Attension": "Внимание",
  "Spiritism": "Спиритизм",
  "Alchemy": "Алхимия",
  "Traps": "Ловушки",
  "Lockpicking": "Взлом",
  "Stealing": "Воровство",
  "Leatherwork": "Кожевничество",
  "Prayers": "Молитвы",
  "FoodStoring": "Хранение еды",
  "Trade": "Торговля",
  "Tailoring": "Шитьё",
  "LandscapeDescription": "Благодаря грубой физической силе войны могут изменять ландшафт подземелий - прорубать проходы в зарослях и копать траншеи. Для того что бы изменить ландшафт подземелья потребуется 1 ед. провизии. Каждое очко навыка позволяет изменять ландшафт всё более сложного типа, вплоть до разрушения минералов. При уничтожении ландшафта есть шанс получить ресурсы.",
  "EatingDescription": "Военная подготовка позволяет войнам более качественно распределять провизию, что позволяет восстанавливать больше здоровья за одну ед. провизии. Каждое очко навыка увеличивает восстановления здоровья на 2.5%. Навык расхода еды не суммируется и всегда выбирается наиболее высокий.",
  "RepairDescription": "Навык ремонта позволяет чинить предметы прямо во время странствий. Каждое очко навыка уменьшает расход прочности предметов на 1 ед. Кроме этого, при переходе который тратит провизию на привал есть шанс 2.5% за 1 ед. навыка починить один предмет полностью.",
  "WeaponcraftDescription": "Оружейничество позволяет создавать оружие. Войны могут создавать любые типы оружия из дерева, камня, и металла. Для создания тяжелых доспехов потребуется использовать кузню которая может быть для этого оборудована.",
  "PortalsDescription": "Маги способны создавать порталы для перемещения на большие дистанции и между городами регионов. Для создания портала магу потребуется побывать у городского портала. Каждая 1 ед. навыка позволяет преодолеть расстояние в 4 клетки. Для перемещения между регионами используется формула: каждые 4 ед. навыка позволяют телепортироваться через 1 регион.",
  "AttensionDescription": "Внимание позволяет находить скрытые двери, дополнительные предметы для заданий, замечать ловушки на дверях, переходах и сундуках. Каждая 1 ед. навыка сравнивается с уровнем внимания нужным для проверки навыка. Кроме этого, внимание позволяет заранее знать кого будет атаковать враг, а так же определять его хар-ки по формуле: Внимание>Ур.цели+1",
  "SpiritismDescription": "Спиритизм это навык общения с мёртвыми. Общение с мёртвыми может помочь выяснить детали задания при проверке Ур.навыка>Ур.духа. Так же спиритизм потребуется для обучения некромантии - чем выше уровень спиритизма тем более сильных существ может призвать маг.",
  "AlchemyDescription": "Алхимия позволяет создавать зелья увеличивающие характеристики и дающие дополнительные эффекты как в атаке, так и в защите. Алхимики могут создавать катализаторы для увеличения силы зелий. 1 ед. навыка увеличивает силу катализаторов на 5%, а после 10 уровня позволяет создавать легенадрные зелья.",
  "TrapsDescription": "Воры могут изготавливать и разоружать ловушки. Изготовление ловушек доступно из всех материалов, а использовать их можно заранее на поле боя. Так же, навык ловушек позволяет ворам обезоруживать вражеские ловушки, для разоружения уровень навыка должен быть больше либо равен уровню установленной ловушки. Изготавливаемые ловушки равны по уровню навыку.",
  "LockpickingDescription": "Взлом позволяет взламывать замки на сундуках и дверях. Для успешного взлома замков требуется уровень навыка больше либо равный уровню замка. При уровне навыка больше уровне замка на 10 вы получаете дополнительные ресурсы для изготовления ловушек. При уровне навыка меньше уровня замка на 10 замок блокируется и его больше невозможно открыть.",
  "StealingDescription": "Навык воровства позволяет получить дополнительные предметы для заданий, а так же шанс обворовать цель атаки. Каждая 1ед. навыка даёт 5% шанс украсть один предмет у каждого противника. При успешной краже у одной из целей, следующий процент кражи уменьшается в половину. (Если первая успешная кража была с 15%, то следующий шанс равен 7.5%)",
  "LeatherworkDescription": "Кожевничество позволяет находить и собирать шкуры с убитых врагов, а после этого использовать для изготовления кожаных доспехов.",
  "PrayersDescription": "При нападении на вас даёт шанс получить благословление всему отряду. При нападении на врага даёт шанс навлечь кару на весь отряд противника. 1ед. навыка даёт 5% шанс навлечь кару или получить благословление. За каждые 5ед. навыка кол-во благословлений или кары увеличивается на 1. (15ед. навыка позволяет получить/навлечь 3 кары/благословления)",
  "FoodStoringDescription": "Долгие годы служения в храмах и аббатах открыли священникам тайны хранения еды. 1 ед. навыка позволяет увеличить кол-во запасов еды которые можно хранить в походе на 1. За каждые 2ед. навыка можно хранить новый тип еды, каждый новый тип еды позволяет восстанавливать больше очков здоровья на привале.",
  "TradeDescription": "Торговля позволяет использовать торговые гильдии в поселениях, с помощью которых можно налаживать торговые поставки между регионами. Каждая успешная цепочка поставки даёт пассивный доход раз в сутки. От уровня навыка зависит возможность дальности цепочек поставки, а при максимальном уровне можно перевозить товары через море.",
  "TailoringDescription": "Навык портняжного дела позволяет создавать тканевую одежду которая может увеличивать все характеристики кроме физической защиты. Такая одежда может давать различные магические эффекты не занимая при этом ячейки брони.",
  "WarriorAttack": "Сильный удар",
  "WarriorThrow": "Бросок оружия",
  "WarriorStand": "Защитная стойка",
  "WarriorWarcry": "Боевой клич",
  "MageArrowAttack": "Магическая стрела",
  "MageAoe": "Сфера огня",
  "MageShield": "Каменная кожа",
  "MageSummon": "Призыв элементаля",
  "ThiefAttack": "Скрытая атака",
  "ThiefShadow": "Удар тьмы",
  "ThiefMark": "Метка смерти",
  "ThiefStep": "Быстрый шаг",
  "PriestAttack": "Ошеломляющий удар",
  "PriestHeal": "Исцеление",
  "PriestHolyNova": "Волна света",
  "PriestAngel": "Помощь ангела",
  "WarriorAttackDescription": "Наносит удар тупой стороной оружия по одной цели игнорируя физическую броню.",
  "WarriorThrowDescription": "Бросает оружие в цель во втором ряду. В следующий ход враг будет атаковать война.",
  "WarriorStandDescription": "Увеличивает физическую защиту уменьшая урон от способностей.",
  "WarriorWarcryDescription": "Заставляет всех врагов атаковать война в следующий ход.",
  "MageArrowAttackDescription": "Выпускает магическую стрелу способную нанести урон в любом радиусе.",
  "MageAoeDescription": "Выпускают сферу огня наносящую урон в небольшом радиусе.",
  "MageShieldDescription": "Увеличивает физическую и магическую защиту дружественной цели.",
  "MageSummonDescription": "Призывает элементаля сражающегося на вашей стороне со случайной целью.",
  "ThiefAttackDescription": "Скрытая атака выполняется после любой следующей атаки дружественного существа.",
  "ThiefShadowDescription": "Атака наносящая урон от магии тьмы двум рядом стоящим целям.",
  "ThiefMarkDescription": "Удар наносящий небольшой урон но оставляющий метку на цели увеличивающую повреждения.",
  "ThiefStepDescription": "После активации позволяет совершить два действия подряд в этом ходу.",
  "PriestAttackDescription": "Атака ближнего боя с шансом оглушить врага на один ход.",
  "PriestHealDescription": "Исцеляет выбранного члена отряда. Не работает на призванных существ.",
  "PriestHolyNovaDescription": "Волна света исцеляющая всех членов отряда.",
  "PriestAngelDescription": "Призывает ангела который увеличивает исходящее исцеление и может пожертвовать собой ради жреца.",
  "WarriorFemale": "Аехани",
  "WarriorMale": "Мадаор",
  "MageMale": "Ташин",
  "MageFemale": "Фикора",
  "ThiefMale": "Клиф",
  "ThiefFemale": "Гиссель",
  "PriestMale": "Дженс",
  "PriestFemale": "Селуа",
  "ElementMental": "Ментальный",
  "ElementPhysical": "Физический",
  "ElementFire": "Огонь",
  "ElementFrost": "Холод",
  "ElementMagical": "Магия",
  "ElementSpirit": "Дух",
  "ElementHoly": "Свет",
  "ElementDark": "Тьма"
}