{
  "Identify": "FaithIslandCaptain",
  "Subjects": [
    {
      "Name": "Задание",
      "Text": "Как вы наверно уже слышали, у нас есть проблемы в глубоких пещерах. Мы послали отряд бравых бойцов разузнать что же там случилось, но никто не вернулся.",
      "Variables": [
        {
          "Name": "QuestGetDeepCaveQuest",
          "Value": 44,
          "Global": true
        }
      ],
      "Visible": {
        "Name": "QuestCompleted_DeepCaveQuest"
      },
      "Invisible": {},
      "Replics": [
        {
          "Answer": "Отправиться на поиски",
          "Text": "Глубокие пещеры находятся на самой высокой восточной точке острова. Соберите как можно больше сведений о том что там произошло - нам важно знать что случилось с отрядом, и почему звери из глубокой пещеры стали мутировать.",
          "ReplicsTags": [
            77
          ],
          "Shown": true,
          "Tag": 55,
          "Variables": [
            {
              "Name": "QuestGetDeepCaveQuest",
              "Value": 44,
              "Global": true
            }
          ],
          "TriggerClass": "QuestConversationTrigger",
          "TriggerArguments": [
            "DeepCaveQuest"
          ]
        },
        {
          "Answer": "Отказаться",
          "Text": "У меня катастрофически не хватает бойцов, а ещё и вы отказываетесь!",
          "ReplicsTags": [],
          "Shown": true,
          "Tag": 66,
          "Variables": []
        },
        {
          "Answer": "DeepCaveQuest",
          "Text": "Вы уже узнали в чём дело?",
          "ReplicsTags": [
            45,
            46
          ],
          "Tag": 44,
          "Variables": []
        },
        {
          "Answer": "Нет",
          "Text": "Возвращайтесь с точными данными",
          "ReplicsTags": [
            77
          ],
          "Tag": 46,
          "Variables": []
        },
        {
          "Answer": "Назад",
          "ReplicsTags": [],
          "Tag": 77,
          "Variables": [],
          "Escape": true
        }
      ]
    },
    {
      "Name": "Городская стража",
      "Text": "Вы находитесь в доме стражи Острова Веры. Доблестные стражи защищают город и весь остров от пиратов красного моря и посигания материка на суверенное государство Трёх Островов.",
      "Variables": [],
      "Visible": {},
      "Invisible": {},
      "Replics": [
        {
          "Answer": "Пираты",
          "Text": "Ежедневно суда пиратов красного моря приближаются к острову. У нас есть специальный отряд перехвата на море который не допускает нападения. Особенно сложно им приходится во время штормов, в неспокойные недели некоторые отряды пиратов добираются до берега и нам приходится с ними оперативно разбираться.",
          "ReplicsTags": [],
          "Shown": true,
          "Variables": []
        },
        {
          "Answer": "Три Острова",
          "Text": "Остров Веры относится к материку формально. На самом деле он находится под юрисдикцией государства Трёх Островов: Остров Веры, Остров Отчаянья, Остров Храбрых. Центральный орган управления располагается на острове Храбрых, Остров Отчаянья является его колонией, а Остров Веры был подарком материка для того что бы прекратить разрушительную войну. Многие жители всё ещё считают себя частью материка, однако несколько раз в год к нам приезжает посол трёх островов для првоерки формальностей.",
          "ReplicsTags": [],
          "Shown": true,
          "Variables": []
        }
      ]
    }
  ],
  "Face": "Dungeon12.Resources.Images.NPCs.FaithIsland.ArcherF.png",
  "Name": "Капитан стражи"
}