{
  "Identify": "FaithIslandCaptain",
  "Subjects": [
    {
      "Name": "Задание",
      "Text": "Как вы наверно уже слышали, у нас есть проблемы в глубоких пещерах. Мы послали отряд бравых бойцов разузнать что же там случилось, но никто не вернулся.",
      "Variables": [
        {
          "Name": "QuestGetDeepCaveQuest",
          "Value": 44,
          "Global": true
        }
      ],
      "Visible": {
        "Name": "QuestCompleted_DeepCaveQuest"
      },
      "Invisible": {},
      "Replics": [
        {
          "Answer": "Отправиться на поиски",
          "Text": "Глубокие пещеры находятся на самой высокой восточной точке острова. Соберите как можно больше сведений о том, что там произошло. Нам важно знать, что случилось с отрядом, и почему звери из глубокой пещеры стали мутировать.",
          "ReplicsTags": [
            77
          ],
          "Shown": true,
          "Tag": 55,
          "Variables": [
            {
              "Name": "QuestGetDeepCaveQuest",
              "Value": 44,
              "Global": true
            }
          ],
          "TriggerClass": "QuestConversationTrigger",
          "TriggerArguments": [
            "DeepCaveQuest",
            "PassRespawnTrigger",
            "DeepCaveGuards"
          ]
        },
        {
          "Answer": "Отказаться",
          "Text": "У меня катастрофически не хватает бойцов, а ещё и вы отказываетесь!",
          "ReplicsTags": [],
          "Shown": true,
          "Tag": 66,
          "Variables": []
        },
        {
          "Answer": "DeepCaveQuest",
          "Text": "Вы уже узнали в чём дело?",
          "ReplicsTags": [
            46
          ],
          "Tag": 44,
          "Variables": []
        },
        {
          "Answer": "Нет",
          "Text": "Возвращайтесь с точными данными",
          "ReplicsTags": [
            77
          ],
          "Tag": 46,
          "Variables": []
        },
        {
          "Answer": "Назад",
          "ReplicsTags": [],
          "Tag": 77,
          "Variables": [],
          "Escape": true
        }
      ]
    },
    {
      "Name": "Городская стража",
      "Text": "Вы находитесь в доме стражи Острова Веры. Доблестные стражи защищают город и весь остров от пиратов красного моря и посигания материка на суверенное государство Трёх Островов.",
      "Variables": [],
      "Visible": {},
      "Invisible": {},
      "Replics": [
        {
          "Answer": "Пираты",
          "Text": "Ежедневно суда пиратов красного моря приближаются к острову. У нас есть специальный отряд перехвата на море, который не допускает нападения. Особенно сложно им приходится во время штормов, в неспокойные недели некоторые отряды пиратов добираются до берега, и нам приходится с ними оперативно разбираться.",
          "ReplicsTags": [],
          "Shown": true,
          "Variables": []
        },
        {
          "Answer": "Три Острова",
          "Text": "Остров Веры относится к материку формально. На самом деле, он находится под юрисдикцией государства Трёх Островов: Остров Веры, Остров Отчаянья, Остров Храбрых. Центральный орган управления располагается на острове Храбрых, Остров Отчаянья является его колонией, а Остров Веры был подарком материка, чтобы прекратить разрушительную войну. Многие жители всё ещё считают себя частью материка, однако, несколько раз в год к нам приезжает посол трёх островов для првоерки формальностей.",
          "ReplicsTags": [],
          "Shown": true,
          "Variables": []
        }
      ]
    },
    {
      "Name": "Задание",
      "Text": "Мэр и Регент уверяют меня, что Культ Крови пытается уничтожить наш город. Я бы с удовольствием хоть сейчас снёс бы их форт, однако, есть одна загвостка - Стража Острова находится в юрисдикции Трёх Островов, а Культ Крови является основной религией на окраине материка. Поэтому нападение без доказательств будет считаться нарушением мирного договора.",
      "Variables": [
        {
          "Name": "QuestGetBloodCultEvidence",
          "Value": 444,
          "Global": true
        }
      ],
      "Visible": {
        "Name": "QuestCompleted_BloodCultEvidence"
      },
      "Invisible": {
        "Name": "FaithIslandPt3"
      },
      "Replics": [
        {
          "Answer": "Я могу достать доказательства",
          "Text": "Отлично, если вы как независимый путешественник принесёте мне доказательства, я смогу отдать приказ об изгнании Культа Крови с Острова даже без разрешения Регента и Мэра. Принесите мне следующие доказательства: приказы от культа крови, такие есть у каждого культиста, любые следы взаимодействия вампиров и культа крови из старого дома, и следы применения магии крови в глубоких пещерах. Связав все три улики вместе, я смогу начать компанию.",
          "ReplicsTags": [
            777
          ],
          "Shown": true,
          "Tag": 555,
          "Variables": [
            {
              "Name": "QuestGetBloodCultEvidence",
              "Value": 444,
              "Global": true
            }
          ],
          "TriggerClass": "QuestConversationTrigger",
          "TriggerArguments": [
            "BloodCultEvidence"
          ]
        },
        {
          "Answer": "Отказаться",
          "Text": "Тогда нам придется ждать коллегию Трёх Островов, надеясь, что не начнётся шторм.",
          "ReplicsTags": [],
          "Shown": true,
          "Tag": 666,
          "Variables": []
        },
        {
          "Answer": "BloodCultEvidence",
          "Text": "Вы достали улики, доказывающие вину Культа Крови?",
          "ReplicsTags": [
            455,
            466
          ],
          "Tag": 444,
          "Variables": []
        },
        {
          "Answer": "Да, они уменя",
          "Text": "Отлично. Всё, что вы мне принесли, полностью доказывает вину культа. Теперь отправляйтесь в их форт и найдите предводителя. Для того, чтобы вам было проще, мы попробуем обучить вас, логда закончим с официальными документами и решим пару дел. План нападения сейчас находится у мэра, сходите к нему для уточнения деталей.",
          "ReplicsTags": [
            777
          ],
          "Tag": 455,
          "Variables": [],
          "TriggerClass": "QuestRewardTryTrigger",
          "TriggerArguments": [
            "BloodCultEvidence",
            "QuestCompleted_BloodCultEvidence",
            "Мы не можем ждать вечно, культ может в любой момент напасть на город!",
            "Отлично. Всё, что вы мне принесли, полностью доказывает вину культа. Теперь отправляйтесь в их форт и найдите предводителя. Для того, чтобы вам было проще, мы попробуем обучить вас, когда закончим с официальными документами и решим пару дел. План нападения сейчас находится у мэра, сходите к нему для уточнения деталей."
          ]
        },
        {
          "Answer": "Я ещё ищу их",
          "Text": "Мы не можем ждать вечно, культ может в любой момент напасть на город!",
          "ReplicsTags": [
            777
          ],
          "Tag": 466,
          "Variables": []
        },
        {
          "Answer": "Назад",
          "ReplicsTags": [],
          "Tag": 777,
          "Variables": [],
          "Escape": true
        }
      ]
    }
  ],
  "Face": "Dungeon12.Resources.Images.NPCs.FaithIsland.ArcherF.png",
  "Name": "Капитан стражи"
}