{
  "Identify": "FaithIslandJosephine",
  "Subjects": [
    {
      "Name": "Травничество",
      "Text": "Как и любая профессия, травничество может приносить пользу, и не только.",
      "Variables": [],
      "Visible": {},
      "Invisible": {},
      "Replics": [
        {
          "Answer": "Яды",
          "Text": "Изначально яды и были целью исследований у всех аптекарей. Однако позже они узнали что могут использовать их в целях более благородных. Все яды которые изготавливают аптекари подчиняющиеся \"печати аптекарей\" практически безвредны, и даже огромными дозами лекарств вы не сможете навредить. Такой эффект достигается принудительным реверсом магической силы аптекарей так, что они не могут наложить никаких чар кроме исцеляющих.",
          "ReplicsTags": [
            3
          ],
          "Shown": true,
          "Tag": 1,
          "Variables": []
        },
        {
          "Answer": "Препарки",
          "Text": "Это основное средство лечения у любого аптекаря. Мы можем изготавливать лечебные повязки практически из любой травы, добавляя к ней щепотку магии от печати аптекарей. На острове я по делу, поэтому не могу отвлекаться на обучение, но уверена что в главном здании гильдии аптекарей кто ни будь мог бы обучить вас изготовлению препарок, пусть и не магических",
          "ReplicsTags": [],
          "Shown": true,
          "Tag": 2,
          "Variables": []
        },
        {
          "Answer": "Яды как средство убийства",
          "Text": "Да, некоторые всё же используют яды для того что бы нанаосить с их помощью вред. Мастера которые не подверглись печати со временем тайно вышли из гильдии аптекарей и ушли в подполье. На данный момент мне известно что большая часть таких мастеров проживает в бравом берегу. В тайных палатах они изготавливают яды на экспорт и для гильдии убийц.",
          "ReplicsTags": [],
          "Tag": 3,
          "Variables": []
        }
      ]
    },
    {
      "Name": "Задание",
      "Text": "Вместе с периодом распространения печатей аптекарей на материке были уничтожены все существа с каким-либо сильным ядом. Но до Острова Веры святая инквизиция не добралась. Поэтому здесь вы можете получить яды совершенно легально, если не будете вывозить их с острова. Цель с которой я прибыла на остров связана с этими ядами, которые самой мне не достать. Поможете мне в этом?",
      "Variables": [
        {
          "Name": "QuestGetThreePoisons",
          "Value": 44,
          "Global": true
        }
      ],
      "Visible": {
        "Name": "QuestCompleted_ThreePoisons"
      },
      "Invisible": {},
      "Replics": [
        {
          "Answer": "Взять задание",
          "Text": "Отлично! Несколько недель назад процветающий купец Алмар попросил меня прибыть на остров для изготовления лекарства от Вампиризма. В архивах аптекарей содержится информация о том как лечить такого рода заболевания, но работать лекарство будет только если изготовлено из сильных ядов. Создать такие яды сама я не могу, но они содержатся в слюне животных здесь, на Острове Веры. Достаньте для меня три разных яда, и я смогу сварить противоядие для купца Алмара.",
          "ReplicsTags": [
            77
          ],
          "Shown": true,
          "Tag": 55,
          "Variables": [
            {
              "Name": "QuestGetThreePoisons",
              "Value": 44,
              "Global": true
            }
          ],
          "TriggerClass": "QuestConversationTrigger",
          "TriggerArguments": [
            "ThreePoisons"
          ]
        },
        {
          "Answer": "Отказаться",
          "Text": "Вы уже третий кто отказывается, возможно мне стоит заняться этим самой...",
          "ReplicsTags": [],
          "Shown": true,
          "Tag": 66,
          "Variables": []
        },
        {
          "Answer": "ThreePoisons",
          "Text": "Вы нашли все три яда?",
          "ReplicsTags": [
            45,
            46
          ],
          "Tag": 44,
          "Variables": []
        },
        {
          "Answer": "Да, они у меня",
          "Text": "Отлично, я сейчас же сварю для вас бутылёк. Положите его тёмное место.",
          "ReplicsTags": [
            77
          ],
          "Tag": 45,
          "Variables": [],
          "TriggerClass": "QuestRewardTryTrigger",
          "TriggerArguments": [
            "ThreePoisons",
            "QuestCompleted_ThreePoisons",
            "Текст не выполненного задания",
            "Текст выполненного задания"
          ]
        },
        {
          "Answer": "Нет",
          "Text": "Возвращайтесь когда соберёте все три",
          "ReplicsTags": [
            77
          ],
          "Tag": 46,
          "Variables": []
        },
        {
          "Answer": "Назад",
          "ReplicsTags": [],
          "Tag": 77,
          "Variables": [],
          "Escape": true
        }
      ]
    }
  ],
  "Face": "Dungeon12.Resources.Images.NPCs.FaithIsland.MayorF.png",
  "Name": "Аптекарь Джозефина"
}