{
  "Identify": "ServantOfFaithMain",
  "Face": "Dungeon12.Resources.Images.NPCs.FaithIsland.ServantF.png",
  "Subjects": [
    {
      "Name": "Посещение Острова",
      "Text": "Я здесь с целью туризма. Даже у инквизиторов должен быть отпуск.",
      "Replics": [
        {
          "Shown": true,
          "Tag": 5,
          "Answer": "Путешествия",
          "Text": "Инквизиция никак не ограничивает граждан материка в путешествиях, вы можете посещать любые регионы и даже острова. Единственное место посещения которое подлежит налогу является пустыня Менга, но что бы туда попасть вам понадобится разрешение совета.",
          "ReplicsTags": []
        },
        {
          "Shown": true,
          "Tag": 6,
          "Answer": "Природа Острова",
          "Text": "Мне казалось что остров должен быть более дружелюбным, пока я здесь отдыхала - составила небольшую брошуру по Острову: в северной верхней части острова обосновался культ крови, путь к ним лежит через бывший лес заполненный змеями. В восточной верхней части острова вход в многострадальные глубокие пещеры, сами пещеры и их вход захвачен дикими волками. На севере от города орудует рой пчёл, который защищает пещеру на западе. Есть ещё старый дом к западу от города, сам он пустует, но рядом со входом постоянно обитают летучие мыши.",
          "ReplicsTags": []
        }
      ]
    },
    {
      "Name": "Инквизиция",
      "Text": "Как представитель священной инквизиции - моя обязанность предоставлять информацию о нашей организации.",
      "Replics": [
        {
          "Shown": true,
          "Tag": 5,
          "Answer": "Чем занимается инквизиция?",
          "Text": "Инквизия является единой организацией порядка на материке. Мы занимаемся налогообложением и решением всех политических вопросов во многих регионах острова. А так же предоставляем наёмные отряды для решения вопросов о границах регионов.",
          "ReplicsTags": []
        },
        {
          "Shown": true,
          "Tag": 6,
          "Answer": "Подконтрольные регионы",
          "Text": "Инквизиторы не являются контрольным органом. Наши представительства есть во всех прибрежных регионах кроме оккультной пустыни Менги. Суверенное государство Итерия пользуется услугами наших наёмных отрядов, однако пока что мы не договорились о своём представительстве в этом регионе.",
          "ReplicsTags": []
        },
        {
          "Shown": true,
          "Tag": 7,
          "Answer": "Структура",
          "Text": "Все инквизиторы подчиняются верховному суду в Соколином дозоре, каждым представительством заведует освятитель, в его распоряжении как правило находится три рыцаря и с десяток рядовых. Вся служебная лестница инквизиторов зависит от их заслуг и навыков тренировки оружий равновесия.",
          "ReplicsTags": []
        }
      ]
    }
  ]
}