{
  "Identify": "HighPriestOfFaithF",
  "Subjects": [
    {
      "Name": "Регенство",
      "Text": "Я являюсь регентом Острова Веры. В такие не спокойные времена стража не может полностью обеспечить безопасность острова. Поэтому служители веры стараются сохранять порядок.",
      "Variables": [],
      "Visible": {},
      "Invisible": {},
      "Replics": [
        {
          "Answer": "Какие проблемы на острове?",
          "Text": "Если верить списку который мэр не хочет обнародовать, у нас существует целых три больших проблемы: глубокие пещеры заполнены животными-мутантами, в пещере на западе по всем признакам заселились вампиры, а на месте старого маяка появился форт Культа Крови.",
          "ReplicsTags": [
            1,
            2,
            3
          ],
          "Shown": true,
          "Variables": []
        },
        {
          "Answer": "Расскажите мне про глубокие пещеры",
          "Text": "С недавних пор животные стали мутировать и терроризировать добрую половину острова. Стража не справляется с этой проблемой, а мэр настойчиво не хочет просить помощи с материка.",
          "ReplicsTags": [],
          "Tag": 1,
          "Variables": []
        },
        {
          "Answer": "Вампиры? На Острове Веры?",
          "Text": "Мы не уверены. Однако наши информаторы сообщают о том что вампиры действительно проживают в пещере на западе. Но и это ещё не всё. Многие местные жители замечают что ночами начинает пропадать крупный рогатый скот, а у бедного купца Алмара пропала дочь!",
          "ReplicsTags": [],
          "Tag": 2,
          "Variables": []
        },
        {
          "Answer": "Как связан Культ Крови и старый маяк?",
          "Text": "Старый маяк был построен служителями веры на месте проклятого вулкана. Мы соорудили его для того что бы наладить морское сообщение с материком, пока маяк работает с материка еженедельно приходит судно с товарами и гостями острова. Но недавно один из кораблей прибыл полностью забитый странными людьми в красных рясах. После этого они захватили маяк, отстроили вокруг него форт и называют себя Культом Крови. Пока что они никак не контактируют с городом",
          "ReplicsTags": [],
          "Tag": 3,
          "Variables": []
        }
      ]
    },
    {
      "Name": "Задание",
      "Text": "Я вижу что вы достойный путешественник. Позвольте мне просить у вас помощи для служителей веры?",
      "Variables": [
        {
          "Name": "QuestGetVampireProblem",
          "Value": 44,
          "Global": true
        }
      ],
      "Visible": {
        "Name": "QuestCompleted_VampireProblem"
      },
      "Invisible": {
        "Name": "FaithIslandPt1"
      },
      "Replics": [
        {
          "Answer": "Да, конечно.",
          "Text": "Лорд веры только что рассказал мне что один из служителей веры был в плену у культа крови. Сейчас он находится в дальних палатах и молится о спасении. Он рассказал что культ крови со своим сообщником в городе ночью проводит вампиров в пещеру на западе деревни. Это возмутительно, такие создания не должны находится на острове. Я прошу вас истребить всех вампиров в пещере.",
          "ReplicsTags": [
            77
          ],
          "Shown": true,
          "Tag": 55,
          "Variables": [
            {
              "Name": "QuestGetVampireProblem",
              "Value": 44,
              "Global": true
            }
          ],
          "TriggerClass": "QuestConversationTrigger",
          "TriggerArguments": [
            "VampireProblem"
          ]
        },
        {
          "Answer": "Отказаться",
          "Text": "Служители могут выстоять и без вашей помощи, а вот город - на врятли.",
          "ReplicsTags": [],
          "Shown": true,
          "Tag": 66,
          "Variables": []
        },
        {
          "Answer": "VampireProblem",
          "Text": "Если вы уничтожили всех вампиров принесите мне доказательства",
          "ReplicsTags": [
            45,
            46
          ],
          "Tag": 44,
          "Variables": []
        },
        {
          "Answer": "Я обязательно принесу вам если что-то найду",
          "Text": "Отлично! Я надеюсь что теперь мэр начнёт признавать заслуги служителей перед городом.",
          "ReplicsTags": [
            77
          ],
          "Tag": 45,
          "Variables": [],
          "TriggerClass": "QuestRewardTryTrigger",
          "TriggerArguments": [
            "VampireProblem",
            "QuestCompleted_VampireProblem",
            "Служители могут выстоять и без вашей помощи, а вот город - на врятли.",
            "Текст выполненного задания"
          ]
        },
        {
          "Answer": "Пока что у меня нет времени заниматься этим",
          "Text": "Возвращайтесь с доказательствами",
          "ReplicsTags": [
            77
          ],
          "Tag": 46,
          "Variables": []
        },
        {
          "Answer": "Назад",
          "ReplicsTags": [],
          "Tag": 77,
          "Variables": [],
          "Escape": true
        }
      ]
    }
  ],
  "Face": "Dungeon12.Resources.Images.NPCs.FaithIsland.HighPriestOfFaithF.png",
  "Name": "Высшая жрица веры"
}