{
  "Identify": "FaithIslandFrederick",
  "Subjects": [
    {
      "Name": "Оккультизм",
      "Text": "Вы бы хотели по-больше узнать о сферах оккультизма?",
      "Variables": [],
      "Visible": {},
      "Invisible": {},
      "Replics": [
        {
          "Answer": "Некромантия",
          "Text": "Это искусство поднятия мёртвых. Владея навыками некромантии, вы можете оживить мёртвые кости, призрака, и даже камень. В основном, некроманты работают с костями, потому что в них содержится много магической силы. Самые сильные некроманты находятся в мёртвых землях, однако, именно из-за этого тёмного искусства некогда живые леса превратились в мёртвое плато. Сейчас центр некромантии находится в тёмном лесу.",
          "ReplicsTags": [],
          "Shown": true,
          "Variables": []
        },
        {
          "Answer": "Тёмная магия",
          "Text": "Тёмная магия - одна из старейших оккультных наук. Это наука о проклятьях и зловещих призраках прошлого. Адепты тёмной магии умеют насылать болезни на целые города и сёла, однако, их ритуалы часто требуют много времени. С другой стороны, если вы хотите медленно убить вашего соперника через проклятую чашку, тёмная магия - ваш путь. Чистых тёмных магов больше нет, но гильдия убийц в бухте пустоты ещё может научить вас.",
          "ReplicsTags": [],
          "Shown": true,
          "Variables": []
        },
        {
          "Answer": "Демонология",
          "Text": "О! Демонология! Отличный выбор! Я, признаться, очень люблю это оккультное мастерство, но так и не смог в нём преуспеть. Дело в том, что вызовом и управлением демонов ранее занимались в пустыне Минеги. Но после того, что некроманты устроили в мёртвых землях, путь туда теперь закрыт. Но я думаю, что вам прекрасно известны инквизиторы крайней земли. Пусть они и не умеют призывать и управлять демонами как таковыми, у них отлично получается контролировать своего персонального демона, так что вы можете научиться чему-нибудь и у них.",
          "ReplicsTags": [],
          "Shown": true,
          "Variables": []
        },
        {
          "Answer": "Магия крови",
          "Text": "Это как раз моя специализация! Магия крови сама по себе не происходит ни из какой основной оккультной науки, однако, её принято туда относить. А всё потому, что магия крови является тёмной стороной магии воды - той, что даёт нам жизнь. Магия крови позволяет контролировать все живые существа, в которых есть эта прекрасная жидкость, а так же даёт изменять её на самом низком уровне, позволяя вам модифицировать существ, как вы захотите. Известно, что древние боги и демоны использовали именно магию крови, а не магию воды, для того, чтобы обрести бессмертие.",
          "ReplicsTags": [],
          "Shown": true,
          "Variables": []
        }
      ]
    },
    {
      "Name": "Задание",
      "Text": "Как вы уже поняли, я оккультист. Если точнее - маг крови. Множество из моих \"коллег\" прибыли на остров после проявления магии крови у старого маяка. Сейчас они построили там свой форт, и стараются изучить как можно больше. К сожалению, они не хотят принимать меня. Возможно такой приключенец как вы, без сильных моральных тяжб, сможет мне помочь?",
      "Variables": [
        {
          "Name": "QuestGetBloodCultEntry",
          "Value": 44,
          "Global": true
        }
      ],
      "Visible": {
        "Name": "QuestCompleted_BloodCultEntry"
      },
      "Invisible": { "Name": "demo"},
      "Replics": [
        {
          "Answer": "У меня никогда не было проблем с магией крови",
          "Text": "Я слышал, что животные в глубоких пещерах стали мутировать. Мне кажется, что здесь точно замешана магия крови. Возможно, исследователи культа случайно прорыли тунель в глубокие пещеры, и их эксперементы частично повлияли на местную фауну. Согласно планам, которые я нашёл в Зейе, в глубокие пещеры выходит крыло древней библиотеки храма под маяком. Не могли бы вы принести мне какой-нибудь манускрипт оттуда? С ним, я уверен, культ точно примет меня в свои ряды!",
          "ReplicsTags": [
            77
          ],
          "Shown": true,
          "Tag": 55,
          "Variables": [
            {
              "Name": "QuestGetBloodCultEntry",
              "Value": 44,
              "Global": true
            }
          ],
          "TriggerClass": "QuestConversationTrigger",
          "TriggerArguments": [
            "BloodCultEntry"
          ]
        },
        {
          "Answer": "Я не буду ни каким образом помогать культу крови",
          "Text": "Не думаю, что культ крови будет мешать кому-нибудь, по крайней мере, мои помыслы чисты и касаются тоьлко исследования этого странного явления.",
          "ReplicsTags": [],
          "Shown": true,
          "Tag": 66,
          "Variables": []
        },
        {
          "Answer": "BloodCultEntry",
          "Text": "Вы нашли какой-нибудь полезный манускрипт?",
          "ReplicsTags": [
            45,
            46
          ],
          "Tag": 44,
          "Variables": []
        },
        {
          "Answer": "Да, он у меня.",
          "Text": "Отлично, это манускрипт силы! Как же вам повезло. Кроме того, что я могу попытаться вступить в ряды культа крови, я могу научить вас какой-нибудь древней магии. Если вы, конечно, предрасположены к магии.",
          "ReplicsTags": [
            77
          ],
          "Tag": 45,
          "Variables": [],
          "TriggerClass": "QuestRewardTryTrigger",
          "TriggerArguments": [
            "BloodCultEntry",
            "QuestCompleted_BloodCultEntry",
            "Пожалуйста, найдите хоть что ни будь!",
            "Этого задания нет в демо"
          ]
        },
        {
          "Answer": "Пока что я продолжаю поиски",
          "Text": "Пожалуйста, найдите хоть что-нибудь!",
          "ReplicsTags": [
            77
          ],
          "Tag": 46,
          "Variables": []
        },
        {
          "Answer": "Назад",
          "ReplicsTags": [],
          "Tag": 77,
          "Variables": [],
          "Escape": true
        }
      ]
    }
  ],
  "Face": "Dungeon12.Resources.Images.NPCs.FaithIsland.MayorF.png",
  "Name": "Оккультист Фредерик"
}