{
  "Identify": "FaithLordEnd",
  "Subjects": [
    {
      "Name": "Осорзул",
      "Text": "Осорзул - это имя пожирателя миров. После уничтожения мёртвых богов он нашёл способ жить за счёт пожирания планет. Три поколения назад он основал на этой планете 12 святилищ, которые созданы для того, что бы разорвать планету и передать её жизненную силу ему. ",
      "Variables": [],
      "Visible": {},
      "Invisible": {},
      "Replics": [
        {
          "Shown": true,
          "Answer": "Осорзул был изгнан!",
          "Text": "Да, три поколения назад его изгнали, но он успел установить 12 святилищ. Мы - культ Валора, помогали ему в этом. Конечно, со временем нас уничтожили, но мне удалось выжить и основать религию Острова веры.\r\nНедавно Осорзул связался со мной и сказал, что пришло время пробудить святилища.",
          "ReplicsTags": [
            2
          ],
          "Tag": 1,
          "Variables": []
        },
        {
          "Answer": "Ты помогаешь ему?",
          "Text": "Не совсем. Когда я был молод, я изучал всю историю Осорзула из архивов, которые он нам открывал для возведения святилищ. В самой главной книге магии крови есть описание ритуала, с помощью которого Осорзул возвращается к жизни. Ритуал очень сложен, и если в ответственный момент кто-то сможет ему помешать, поток вечной жизни можно будет перенаправить.",
          "ReplicsTags": [
            3
          ],
          "Tag": 2,
          "Variables": []
        },
        {
          "Answer": "Я не дам тебе разрушить планету",
          "Text": "К сожалению, судьба не на твоей стороне. Ты очень слабый герой, поэтому мне ничего не помешает принести тебя в жертву для изменения ритуала.",
          "ReplicsTags": [
            0
          ],
          "Tag": 3,
          "Variables": []
        },
        {
          "Answer": "...",
          "ReplicsTags": [],
          "Variables": [],
          "TriggerClass": "EndTrigger"
        }
      ]
    }
  ],
  "Face": "Dungeon12.Resources.Images.NPCs.FaithIsland.FaithLordF.png",
  "Name": "Лорд Веры"
}